IRP/src/Documents/FixedAssetTransfer/FixedAssetTransfer.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>FixedAssetTransfer</name>
  <registerRecords>InformationRegister.T8515S_FixedAssetsLocation</registerRecords>
  <registerRecords>AccumulationRegister.R8510B_BookValueOfFixedAsset</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>FixedAsset</name>
    <type>
      <types>CatalogRef.FixedAssets</types>
    </type>
  </attributes>
  <attributes>
    <name>ResponsiblePersonSender</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>ResponsiblePersonReceiver</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>BranchSender</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>BranchReceiver</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyFrom</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ReverseRate</name>
      <type>
        <types>DefinedType.typeCurrencyRate</types>
      </type>
    </attributes>
    <attributes>
      <name>ShowReverseRate</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.typeAmount</types>
      </type>
    </attributes>
    <attributes>
      <name>IsFixed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/InformationRegisters/T8515S_FixedAssetsLocation/T8515S_FixedAssetsLocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T8515S_FixedAssetsLocation</name>
 <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>IsActive</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>FixedAsset</name>
  <type>
   <types>CatalogRef.FixedAssets</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ResponsiblePerson</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/AccumulationRegisters/R8510B_BookValueOfFixedAsset/R8510B_BookValueOfFixedAsset.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R8510B_BookValueOfFixedAsset</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>CalculationMovementCost</name>
  <type>
   <types>DocumentRef.CalculationMovementCosts</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>FixedAsset</name>
  <type>
   <types>CatalogRef.FixedAssets</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.FixedAssetsLedgerTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Schedule</name>
  <type>
   <types>CatalogRef.DepreciationSchedules</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/ChartsOfCharacteristicTypes/CurrencyMovementType/CurrencyMovementType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
 <name>CurrencyMovementType</name>
 <type>
  <types>EnumRef.CurrencyType</types>
 </type>
 <predefined>
  <items>
   <name>SettlementCurrency</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_PartnerTerm</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_Legal</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
 </predefined>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Source</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CurrencyType</types>
  </type>
 </attributes>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NotPostIfRateNotSet</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>EverydayRates</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/Documents/FixedAssetTransfer/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure;
	Parameters.IsReposting = False;
	QueryArray = GetQueryTextsSecondaryTables();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);
	Tables.R8510B_BookValueOfFixedAsset.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map;
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	Return;
EndProcedure

#EndRegion

#Region Posting_Info

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure;
	StrParams.Insert("Ref", Ref);
	StrParams.Insert("Company"       , Ref.Company);
	StrParams.Insert("Branch"        , Ref.BranchSender);
	StrParams.Insert("BranchSender"  , Ref.BranchSender);
	StrParams.Insert("BranchReceiver", Ref.BranchReceiver);
	StrParams.Insert("FixedAsset"    , Ref.FixedAsset);
	If ValueIsFilled(Ref) Then
		StrParams.Insert("BalancePeriod" , New Boundary(Ref.PointInTime(), BoundaryType.Excluding));
	Else
		StrParams.Insert("BalancePeriod" , Undefined);
	EndIf;
	StrParams.Insert("Period", Ref.Date);
	
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(T8515S_FixedAssetsLocation());
	QueryArray.Add(R8510B_BookValueOfFixedAsset());
	Return QueryArray;
EndFunction

#EndRegion

#Region Posting_SourceTable

#EndRegion

#Region Posting_MainTables

Function T8515S_FixedAssetsLocation()
	Return
		"SELECT
		|	&Period AS Period,
		|	T8515S_FixedAssetsLocationSliceLast.Company,
		|	T8515S_FixedAssetsLocationSliceLast.FixedAsset,
		|	T8515S_FixedAssetsLocationSliceLast.ResponsiblePerson,
		|	T8515S_FixedAssetsLocationSliceLast.Branch,
		|	FALSE AS IsActive
		|INTO T8515S_FixedAssetsLocation
		|FROM
		|	InformationRegister.T8515S_FixedAssetsLocation.SliceLast(&BalancePeriod, Company = &Company
		|	AND FixedAsset = &FixedAsset
		|	AND Branch = &Branch) AS T8515S_FixedAssetsLocationSliceLast
		|WHERE
		|	T8515S_FixedAssetsLocationSliceLast.IsActive
		|
		|UNION ALL
		|
		|SELECT
		|	FixedAssetTransfer.Date,
		|	FixedAssetTransfer.Company,
		|	FixedAssetTransfer.FixedAsset,
		|	FixedAssetTransfer.ResponsiblePersonReceiver,
		|	FixedAssetTransfer.BranchReceiver,
		|	TRUE
		|FROM
		|	Document.FixedAssetTransfer AS FixedAssetTransfer
		|WHERE
		|	FixedAssetTransfer.Ref = &Ref";
EndFunction

Function R8510B_BookValueOfFixedAsset()
	Return
		"SELECT
		|	&Period AS Period,
		|	R8510B_BookValueOfFixedAssetBalance.Company,
		|	R8510B_BookValueOfFixedAssetBalance.FixedAsset,
		|	R8510B_BookValueOfFixedAssetBalance.LedgerType,
		|	R8510B_BookValueOfFixedAssetBalance.Schedule,
		|	R8510B_BookValueOfFixedAssetBalance.Currency,
		|	R8510B_BookValueOfFixedAssetBalance.AmountBalance AS Amount
		|INTO _BookValueOfFixedAsset
		|FROM
		|	AccumulationRegister.R8510B_BookValueOfFixedAsset.Balance(&BalancePeriod, FixedAsset = &FixedAsset
		|	AND Branch = &BranchSender
		|	AND Company = &Company
		|	AND CurrencyMovementType = VALUE(ChartOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency)) AS
		|		R8510B_BookValueOfFixedAssetBalance
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	VALUE(AccumulationRecordType.Expense) AS RecordType,
		|	_BookValueOfFixedAsset.Period,
		|	_BookValueOfFixedAsset.Company,
		|	&BranchSender AS Branch,
		|	_BookValueOfFixedAsset.FixedAsset,
		|	_BookValueOfFixedAsset.LedgerType,
		|	_BookValueOfFixedAsset.Schedule,
		|	_BookValueOfFixedAsset.Currency,
		|	_BookValueOfFixedAsset.Amount
		|INTO R8510B_BookValueOfFixedAsset
		|FROM
		|	_BookValueOfFixedAsset AS _BookValueOfFixedAsset
		|WHERE
		|	TRUE
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(AccumulationRecordType.Receipt),
		|	_BookValueOfFixedAsset.Period,
		|	_BookValueOfFixedAsset.Company,
		|	&BranchReceiver,
		|	_BookValueOfFixedAsset.FixedAsset,
		|	_BookValueOfFixedAsset.LedgerType,
		|	_BookValueOfFixedAsset.Schedule,
		|	_BookValueOfFixedAsset.Currency,
		|	_BookValueOfFixedAsset.Amount
		|FROM
		|	_BookValueOfFixedAsset AS _BookValueOfFixedAsset
		|WHERE
		|	TRUE";
EndFunction

#EndRegion

#Region AccessObject

// Get access key.
// 
// Parameters:
//  Obj - DocumentObject.FixedAssetTransfer -
// 
// Returns:
//  Map
Function GetAccessKey(Obj) Export
	AccessKeyMap = New Map;
	AccessKeyMap.Insert("Company", Obj.Company);
	BranchList = New Array;
	BranchList.Add(Obj.BranchSender);
	BranchList.Add(Obj.BranchReceiver);
	AccessKeyMap.Insert("Branch", BranchList);
	Return AccessKeyMap;
EndFunction

#EndRegion
